In [16]:
try:
    b = open('dota.csv','x')
    b.close()
except:
    print("The file is already there.")

The file is already there.

In [18]:
import csv
csvfile = open('dota.csv')
reader = csv.DictReader(csvfile)
for row in reader:
    print(row)

{'sn': '0', 'Name': 'Ram', 'Age': '67', 'Address': 'Kathmandu', 'Phone': '9856554543'}
{'sn': '1', 'Name': 'Shyam', 'Age': '34', 'Address': 'Patan', 'Phone': '9856554543'}
{'sn': '2', 'Name': 'Hari', 'Age': '23', 'Address': 'Bara', 'Phone': '9856554543'}
{'sn': '3', 'Name': 'Nabin', 'Age': '34', 'Address': 'Simara', 'Phone': '9856554543'}
{'sn': '4', 'Name': 'Rita', 'Age': '23', 'Address': 'Nagarkot', 'Phone': '9856554543'}
{'sn': '5', 'Name': 'Sabita', 'Age': '45', 'Address': 'Bhaktapur', 'Phone': '9845445443'}

In [20]:
import pandas as pd
df = pd.read_csv('dota.csv')
df

   sn    Name  Age    Address       Phone
0   0     Ram   67  Kathmandu  9856554543
1   1   Shyam   34      Patan  9856554543
2   2    Hari   23       Bara  9856554543
3   3   Nabin   34     Simara  9856554543
4   4    Rita   23   Nagarkot  9856554543
5   5  Sabita   45  Bhaktapur  9845445443

In [6]:
# pip install pandas
# pip3 install pandas

In [22]:
import pandas as pd
df = pd.read_csv('dota.csv',nrows = 3)
df

   sn   Name  Age    Address       Phone
0   0    Ram   67  Kathmandu  9856554543
1   1  Shyam   34      Patan  9856554543
2   2   Hari   23       Bara  9856554543

In [23]:
import pandas as pd
df = pd.read_csv('dota.csv')
# df.head()
df.tail(3)

   sn    Name  Age    Address       Phone
3   3   Nabin   34     Simara  9856554543
4   4    Rita   23   Nagarkot  9856554543
5   5  Sabita   45  Bhaktapur  9845445443

In [25]:
import pandas as pd
df = pd.read_csv('dota.csv',index_col = 'sn')
df

      Name  Age    Address       Phone
sn
0      Ram   67  Kathmandu  9856554543
1    Shyam   34      Patan  9856554543
2     Hari   23       Bara  9856554543
3    Nabin   34     Simara  9856554543
4     Rita   23   Nagarkot  9856554543
5   Sabita   45  Bhaktapur  9845445443

In [18]:
import pandas as pd
df = pd.read_csv('dota.csv',index_col = 'sn')
df.iloc[1:5,0:3]

     Name  Age   Address
sn
1   Shyam   34     Patan
2    Hari   23      Bara
3   Nabin   34    Simara
4    Rita   23  Nagarkot

In [19]:
import pandas as pd
df = pd.read_csv('dota.csv',index_col = 'sn')
df.loc[2:5]

      Name  Age    Address       Phone
sn
2     Hari   23       Bara  9856554543
3    Nabin   34     Simara  9856554543
4     Rita   23   Nagarkot  9856554543
5   Sabita   45  Bhaktapur  9845445443

In [49]:
import pandas as pd
df = pd.read_csv('dota.csv',index_col = 'Name')
df.loc["Shyam":"Nabin"]

       sn  Age Address       Phone
Name
Shyam   1   34   Patan  9856554543
Hari    2   23    Bara  9856554543
Nabin   3   34  Simara  9856554543

In [30]:
import pandas as pd
df = pd.read_csv('dota.csv',index_col = 'sn')
df[df['Age']>30]

ParserError: Error tokenizing data. C error: Expected 5 fields in line 8, saw 6

In [22]:
import pandas as pd
df = pd.read_csv('dota.csv',index_col = 'sn')
df[df['Address']=="Kathmandu"]

   Name  Age    Address       Phone
sn
0   Ram   67  Kathmandu  9856554543

In [23]:
import pandas as pd
df = pd.read_csv('dota.csv',index_col = 'Name',usecols = ['Name','Address'])
df

          Address
Name
Ram     Kathmandu
Shyam       Patan
Hari         Bara
Nabin      Simara
Rita     Nagarkot
Sabita  Bhaktapur

In [24]:
import pandas as pd
df = pd.read_csv('dota.csv',index_col = 'sn')
df1 = df[(df['Age']>20) & (df['Address'] == 'Kathmandu')]
df1.to_csv('df1.csv')

In [34]:
type(df1)

pandas.core.frame.DataFrame

In [81]:
import csv   
fields=[7,"Hari",78,"Kathmandu",9856554543,"\n"]
f = open('dota.csv', 'a+')
x = csv.writer(f)
x.writerow(fields)
f.close()

In [26]:
a = [["Name","Price","Quantity","Total"],['Apple', 100, 2, 200], 
     ['Banana', 200, 3, 600], ['milk', 100, 3, 300]]

import csv   
f = open('dota1.csv', 'a')
x = csv.writer(f)
for i in a:
    x.writerow(i)
f.close()

In [27]:
# DictWriter()
# dotaFrame()

In [47]:
import pandas as pd
df = pd.read_csv('dota.csv',index_col = 'Name')
df[df['sn']==[]]

SyntaxError: invalid syntax (<ipython-input-47-a36285599ad0>, line 3)

In [78]:
import pandas as pd
df = pd.read_csv('dota.csv',index_col = 'Name')
print(df.loc["Ram"])
print(df.loc["Hari"])

sn                  0
Age                67
Address     Kathmandu
Phone      9856554543
Name: Ram, dtype: object
sn                  2
Age                23
Address          Bara
Phone      9856554543
Name: Hari, dtype: object